GopalSaraf/Practicals/PSDL/include/proc/pic16f18857.h
extern volatile CCP3CAPbits_t CCP3CAPbits __at(0x317);
// bitfield macros
#define _CCP3CAP_CTS_POSN                                   0x0
#define _CCP3CAP_CTS_POSITION                               0x0
#define _CCP3CAP_CTS_SIZE                                   0x8
#define _CCP3CAP_CTS_LENGTH                                 0x8
#define _CCP3CAP_CTS_MASK                                   0xFF
#define _CCP3CAP_CTS0_POSN                                  0x0
#define _CCP3CAP_CTS0_POSITION                              0x0
#define _CCP3CAP_CTS0_SIZE                                  0x1
#define _CCP3CAP_CTS0_LENGTH                                0x1
#define _CCP3CAP_CTS0_MASK                                  0x1
#define _CCP3CAP_CTS1_POSN                                  0x1
#define _CCP3CAP_CTS1_POSITION                              0x1
#define _CCP3CAP_CTS1_SIZE                                  0x1
#define _CCP3CAP_CTS1_LENGTH                                0x1
#define _CCP3CAP_CTS1_MASK                                  0x2
#define _CCP3CAP_CTS2_POSN                                  0x2
#define _CCP3CAP_CTS2_POSITION                              0x2
#define _CCP3CAP_CTS2_SIZE                                  0x1
#define _CCP3CAP_CTS2_LENGTH                                0x1
#define _CCP3CAP_CTS2_MASK                                  0x4
#define _CCP3CAP_CCP3CTS_POSN                               0x0
#define _CCP3CAP_CCP3CTS_POSITION                           0x0
#define _CCP3CAP_CCP3CTS_SIZE                               0x8
#define _CCP3CAP_CCP3CTS_LENGTH                             0x8
#define _CCP3CAP_CCP3CTS_MASK                               0xFF
#define _CCP3CAP_CCP3CTS0_POSN                              0x0
#define _CCP3CAP_CCP3CTS0_POSITION                          0x0
#define _CCP3CAP_CCP3CTS0_SIZE                              0x1
#define _CCP3CAP_CCP3CTS0_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS0_MASK                              0x1
#define _CCP3CAP_CCP3CTS1_POSN                              0x1
#define _CCP3CAP_CCP3CTS1_POSITION                          0x1
#define _CCP3CAP_CCP3CTS1_SIZE                              0x1
#define _CCP3CAP_CCP3CTS1_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS1_MASK                              0x2
#define _CCP3CAP_CCP3CTS2_POSN                              0x2
#define _CCP3CAP_CCP3CTS2_POSITION                          0x2
#define _CCP3CAP_CCP3CTS2_SIZE                              0x1
#define _CCP3CAP_CCP3CTS2_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS2_MASK                              0x4

// Register: CCPR4
#define CCPR4 CCPR4
extern volatile unsigned short          CCPR4               __at(0x318);
#ifndef _LIB_BUILD
asm("CCPR4 equ 0318h");
#endif

// Register: CCPR4L
#define CCPR4L CCPR4L
extern volatile unsigned char           CCPR4L              __at(0x318);
#ifndef _LIB_BUILD
asm("CCPR4L equ 0318h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL                     :8;
    };
} CCPR4Lbits_t;
extern volatile CCPR4Lbits_t CCPR4Lbits __at(0x318);
// bitfield macros
#define _CCPR4L_RL_POSN                                     0x0
#define _CCPR4L_RL_POSITION                                 0x0
#define _CCPR4L_RL_SIZE                                     0x8
#define _CCPR4L_RL_LENGTH                                   0x8
#define _CCPR4L_RL_MASK                                     0xFF

// Register: CCPR4H
#define CCPR4H CCPR4H
extern volatile unsigned char           CCPR4H              __at(0x319);
#ifndef _LIB_BUILD
asm("CCPR4H equ 0319h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH                     :8;
    };
} CCPR4Hbits_t;
extern volatile CCPR4Hbits_t CCPR4Hbits __at(0x319);
// bitfield macros
#define _CCPR4H_RH_POSN                                     0x0
#define _CCPR4H_RH_POSITION                                 0x0
#define _CCPR4H_RH_SIZE                                     0x8
#define _CCPR4H_RH_LENGTH                                   0x8
#define _CCPR4H_RH_MASK                                     0xFF

// Register: CCP4CON
#define CCP4CON CCP4CON
extern volatile unsigned char           CCP4CON             __at(0x31A);
#ifndef _LIB_BUILD
asm("CCP4CON equ 031Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned FMT                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned CCP4MODE               :4;
        unsigned CCP4FMT                :1;
        unsigned CCP4OUT                :1;
        unsigned                        :1;
        unsigned CCP4EN                 :1;
    };
    struct {
        unsigned CCP4MODE0              :1;
        unsigned CCP4MODE1              :1;
        unsigned CCP4MODE2              :1;
        unsigned CCP4MODE3              :1;
    };
} CCP4CONbits_t;
extern volatile CCP4CONbits_t CCP4CONbits __at(0x31A);
// bitfield macros
#define _CCP4CON_MODE_POSN                                  0x0
#define _CCP4CON_MODE_POSITION                              0x0
#define _CCP4CON_MODE_SIZE                                  0x4
#define _CCP4CON_MODE_LENGTH                                0x4
#define _CCP4CON_MODE_MASK                                  0xF
#define _CCP4CON_FMT_POSN                                   0x4
#define _CCP4CON_FMT_POSITION                               0x4
#define _CCP4CON_FMT_SIZE                                   0x1
#define _CCP4CON_FMT_LENGTH                                 0x1
#define _CCP4CON_FMT_MASK                                   0x10
#define _CCP4CON_OUT_POSN                                   0x5
#define _CCP4CON_OUT_POSITION                               0x5
#define _CCP4CON_OUT_SIZE                                   0x1
#define _CCP4CON_OUT_LENGTH                                 0x1
#define _CCP4CON_OUT_MASK                                   0x20
#define _CCP4CON_EN_POSN                                    0x7
#define _CCP4CON_EN_POSITION                                0x7
#define _CCP4CON_EN_SIZE                                    0x1
#define _CCP4CON_EN_LENGTH                                  0x1
#define _CCP4CON_EN_MASK                                    0x80
#define _CCP4CON_MODE0_POSN                                 0x0
#define _CCP4CON_MODE0_POSITION                             0x0
#define _CCP4CON_MODE0_SIZE                                 0x1
#define _CCP4CON_MODE0_LENGTH                               0x1
#define _CCP4CON_MODE0_MASK                                 0x1
#define _CCP4CON_MODE1_POSN                                 0x1
#define _CCP4CON_MODE1_POSITION                             0x1
#define _CCP4CON_MODE1_SIZE                                 0x1
#define _CCP4CON_MODE1_LENGTH                               0x1
#define _CCP4CON_MODE1_MASK                                 0x2
#define _CCP4CON_MODE2_POSN                                 0x2
#define _CCP4CON_MODE2_POSITION                             0x2
#define _CCP4CON_MODE2_SIZE                                 0x1
#define _CCP4CON_MODE2_LENGTH                               0x1
#define _CCP4CON_MODE2_MASK                                 0x4
#define _CCP4CON_MODE3_POSN                                 0x3
#define _CCP4CON_MODE3_POSITION                             0x3
#define _CCP4CON_MODE3_SIZE                                 0x1
#define _CCP4CON_MODE3_LENGTH                               0x1
#define _CCP4CON_MODE3_MASK                                 0x8
#define _CCP4CON_CCP4MODE_POSN                              0x0
#define _CCP4CON_CCP4MODE_POSITION                          0x0
#define _CCP4CON_CCP4MODE_SIZE                              0x4
#define _CCP4CON_CCP4MODE_LENGTH                            0x4
#define _CCP4CON_CCP4MODE_MASK                              0xF
#define _CCP4CON_CCP4FMT_POSN                               0x4
#define _CCP4CON_CCP4FMT_POSITION                           0x4
#define _CCP4CON_CCP4FMT_SIZE                               0x1
#define _CCP4CON_CCP4FMT_LENGTH                             0x1
#define _CCP4CON_CCP4FMT_MASK                               0x10
#define _CCP4CON_CCP4OUT_POSN                               0x5
#define _CCP4CON_CCP4OUT_POSITION                           0x5
#define _CCP4CON_CCP4OUT_SIZE                               0x1
#define _CCP4CON_CCP4OUT_LENGTH                             0x1
#define _CCP4CON_CCP4OUT_MASK                               0x20
#define _CCP4CON_CCP4EN_POSN                                0x7
#define _CCP4CON_CCP4EN_POSITION                            0x7
#define _CCP4CON_CCP4EN_SIZE                                0x1
#define _CCP4CON_CCP4EN_LENGTH                              0x1
#define _CCP4CON_CCP4EN_MASK                                0x80
#define _CCP4CON_CCP4MODE0_POSN                             0x0
#define _CCP4CON_CCP4MODE0_POSITION                         0x0
#define _CCP4CON_CCP4MODE0_SIZE                             0x1
#define _CCP4CON_CCP4MODE0_LENGTH                           0x1
#define _CCP4CON_CCP4MODE0_MASK                             0x1
#define _CCP4CON_CCP4MODE1_POSN                             0x1
#define _CCP4CON_CCP4MODE1_POSITION                         0x1
#define _CCP4CON_CCP4MODE1_SIZE                             0x1
#define _CCP4CON_CCP4MODE1_LENGTH                           0x1
#define _CCP4CON_CCP4MODE1_MASK                             0x2
#define _CCP4CON_CCP4MODE2_POSN                             0x2
#define _CCP4CON_CCP4MODE2_POSITION                         0x2
#define _CCP4CON_CCP4MODE2_SIZE                             0x1
#define _CCP4CON_CCP4MODE2_LENGTH                           0x1
#define _CCP4CON_CCP4MODE2_MASK                             0x4
#define _CCP4CON_CCP4MODE3_POSN                             0x3
#define _CCP4CON_CCP4MODE3_POSITION                         0x3
#define _CCP4CON_CCP4MODE3_SIZE                             0x1
#define _CCP4CON_CCP4MODE3_LENGTH                           0x1
#define _CCP4CON_CCP4MODE3_MASK                             0x8

